'''
张量

0维张量（标量）：单个数字，如 tensor(5)

1维张量（向量）：一维数组，如 [1, 2, 3]

2维张量（矩阵）：二维数组，如 [[1, 2], [3, 4]]

3维张量：如一张RGB图像 (3, 224, 224) - (通道, 高, 宽)

4维张量：如一批图像 (32, 3, 224, 224) - (批大小, 通道, 高, 宽)

更高维张量：如视频数据、Transformer注意力权重等
'''
import torch


# 从数据创建
x = torch.tensor([1, 2, 3])
print(x)                # tensor([1, 2, 3])
print(x.shape)          # torch.Size([3])


print("\n" + "#" * 50)


# 创建随机张量
x = torch.rand(3, 4)    # [0, 1)均匀分布
'''
tensor([[0.5338, 0.9165, 0.0646, 0.5727],
        [0.9586, 0.0538, 0.4933, 0.9449],
        [0.4793, 0.4808, 0.2674, 0.5340]])
'''
print("\n" + str(x))
print(x.shape)          # torch.Size([3, 4])

print('***********************************')

# 标准正态分布
x = torch.randn(3, 4)
'''
tensor([[-0.4617,  0.9369,  1.4320,  1.5183],
        [-0.8317,  0.0178,  0.6033,  1.1223],
        [ 1.5633, -1.0115, -0.9681, -0.0523]])
'''
print(x)
print(x.shape)          # torch.Size([3, 4])

print('***********************************')

# 全零矩阵
x = torch.zeros(2, 3)
'''
tensor([[0., 0., 0.],
        [0., 0., 0.]])
'''
print(x)
print(x.shape)          # torch.Size([2, 3])

print('***********************************')

# 全一矩阵
x = torch.ones(3, 2)
'''
tensor([[1., 1.],
        [1., 1.],
        [1., 1.]])
'''
print(x)
print(x.shape)          # torch.Size([3, 2])
