'''
鸢尾花协方差：PCA降维的依据
    对角线（方差）：花瓣长度方差最大（3.12），说明这个特征变化最剧烈
    非对角线（协方差）：花瓣长度和宽度的协方差为1.30，高度正相关（这就是降维的关键！）
'''
import numpy as np
from sklearn.datasets import load_iris


# 1.加载数据
iris = load_iris()
X = iris.data


# 2.计算协方差矩阵
cov_matrix = np.cov(X.T)
print('协方差矩阵(4x4)：')
'''
[[ 0.68569351 -0.042434    1.27431544  0.51627069]
 [-0.042434    0.18997942 -0.32965638 -0.12163937]
 [ 1.27431544 -0.32965638  3.11627785  1.2956094 ]
 [ 0.51627069 -0.12163937  1.2956094   0.58100626]]
'''
print(cov_matrix)

